package ua.kpi.comsys.ip8410.time

import java.util.*
import kotlin.math.ceil

fun main() {
    val studentsStr = "Дмитренко Олександр - ІП-84; Матвійчук Андрій - ІВ-83; Лесик Сергій - ІО-82; Ткаченко Ярослав - ІВ-83; Аверкова Анастасія - ІО-83; Соловйов Даніїл - ІО-83; Рахуба Вероніка - ІО-81; Кочерук Давид - ІВ-83; Лихацька Юлія- ІВ-82; Головенець Руслан - ІВ-83; Ющенко Андрій - ІО-82; Мінченко Володимир - ІП-83; Мартинюк Назар - ІО-82; Базова Лідія - ІВ-81; Снігурець Олег - ІВ-81; Роман Олександр - ІО-82; Дудка Максим - ІО-81; Кулініч Віталій - ІВ-81; Жуков Михайло - ІП-83; Грабко Михайло - ІВ-81; Іванов Володимир - ІО-81; Востриков Нікіта - ІО-82; Бондаренко Максим - ІВ-83; Скрипченко Володимир - ІВ-82; Кобук Назар - ІО-81; Дровнін Павло - ІВ-83; Тарасенко Юлія - ІО-82; Дрозд Світлана - ІВ-81; Фещенко Кирил - ІО-82; Крамар Віктор - ІО-83; Іванов Дмитро - ІВ-82"

    val studentGroups = studentsStr
        .split(';')
        .map { it.split("- ").map(String::trim) }
        .groupBy { it[1] }
        .mapValues { (_, v) -> v.map { it[0] } }

    println("Завдання 1")
    println(studentGroups)

    val points = listOf(12, 12, 12, 12, 12, 12, 12, 16)
    val studentPoints = studentGroups
        .mapValues { (_, students) ->
            students.map {
                it to List(points.size) { i -> randomValue(points[i]) }
            }.groupBy {
                it.first
            }.mapValues { (_, v) -> v.first().second }
        }

    println("Завдання 2")
    println(studentPoints)

    val sumPoints = studentPoints.mapValues { (_, v) ->
        v.mapValues { (_, marks) -> marks.sum() }
    }

    println("Завдання 3")
    println(sumPoints)

    val groupAvg = sumPoints.mapValues { (_, v) ->
        v.values.sum().toFloat() / (v.size * points.size)
    }

    println("Завдання 4")
    println(groupAvg)

    val passedPerGroup = sumPoints.mapValues { (_, v) ->
        v.filterValues { it >= 60 }.keys
    }

    println("Завдання 5")
    println(passedPerGroup)

//    Приклад виведення
//    Завдання 1
//    {ІП-84=[Дмитренко Олександр], ІВ-83=[Матвійчук Андрій, Ткаченко Ярослав, Кочерук Давид, Головенець Руслан, Бондаренко Максим, Дровнін Павло], ІО-82=[Лесик Сергій, Ющенко Андрій, Мартинюк Назар, Роман Олександр, Востриков Нікіта, Тарасенко Юлія, Фещенко Кирил], ІО-83=[Аверкова Анастасія, Соловйов Даніїл, Крамар Віктор], ІО-81=[Рахуба Вероніка, Дудка Максим, Іванов Володимир, Кобук Назар], ІВ-82=[Лихацька Юлія, Скрипченко Володимир, Іванов Дмитро], ІП-83=[Мінченко Володимир, Жуков Михайло], ІВ-81=[Базова Лідія, Снігурець Олег, Кулініч Віталій, Грабко Михайло, Дрозд Світлана]}
//    Завдання 2
//    {ІП-84={Дмитренко Олександр=[0, 9, 12, 12, 0, 12, 12, 12]}, ІВ-83={Матвійчук Андрій=[12, 12, 12, 0, 11, 11, 12, 15], Ткаченко Ярослав=[11, 12, 12, 12, 9, 0, 12, 15], Кочерук Давид=[0, 12, 12, 9, 9, 12, 12, 16], Головенець Руслан=[0, 0, 12, 0, 11, 12, 0, 16], Бондаренко Максим=[0, 11, 11, 12, 11, 12, 0, 12], Дровнін Павло=[12, 12, 9, 11, 12, 11, 0, 16]}, ІО-82={Лесик Сергій=[12, 0, 0, 12, 0, 9, 12, 15], Ющенко Андрій=[11, 12, 0, 12, 0, 0, 0, 0], Мартинюк Назар=[0, 11, 11, 0, 12, 11, 12, 0], Роман Олександр=[9, 9, 12, 9, 9, 12, 9, 0], Востриков Нікіта=[0, 12, 11, 11, 12, 9, 12, 16], Тарасенко Юлія=[0, 12, 0, 12, 12, 12, 12, 0], Фещенко Кирил=[12, 11, 9, 12, 12, 11, 11, 12]}, ІО-83={Аверкова Анастасія=[12, 12, 9, 12, 11, 12, 12, 16], Соловйов Даніїл=[12, 11, 12, 0, 12, 12, 11, 15], Крамар Віктор=[12, 11, 12, 12, 9, 12, 12, 0]}, ІО-81={Рахуба Вероніка=[12, 11, 12, 9, 12, 12, 0, 12], Дудка Максим=[0, 9, 12, 12, 12, 9, 0, 16], Іванов Володимир=[0, 9, 11, 0, 11, 11, 0, 12], Кобук Назар=[12, 9, 0, 11, 12, 9, 12, 15]}, ІВ-82={Лихацька Юлія=[9, 12, 11, 9, 9, 9, 12, 16], Скрипченко Володимир=[12, 12, 9, 12, 12, 0, 9, 16], Іванов Дмитро=[9, 11, 11, 0, 12, 12, 12, 16]}, ІП-83={Мінченко Володимир=[12, 12, 12, 9, 12, 12, 11, 0], Жуков Михайло=[11, 12, 9, 12, 12, 0, 12, 16]}, ІВ-81={Базова Лідія=[12, 12, 12, 0, 12, 12, 11, 16], Снігурець Олег=[12, 11, 11, 11, 12, 12, 11, 0], Кулініч Віталій=[11, 11, 12, 12, 12, 12, 11, 16], Грабко Михайло=[9, 11, 0, 12, 12, 12, 12, 0], Дрозд Світлана=[11, 12, 11, 9, 9, 9, 12, 15]}}
//    Завдання 3
//    {ІП-84={Дмитренко Олександр=69}, ІВ-83={Матвійчук Андрій=85, Ткаченко Ярослав=83, Кочерук Давид=82, Головенець Руслан=51, Бондаренко Максим=69, Дровнін Павло=83}, ІО-82={Лесик Сергій=60, Ющенко Андрій=35, Мартинюк Назар=57, Роман Олександр=69, Востриков Нікіта=83, Тарасенко Юлія=60, Фещенко Кирил=90}, ІО-83={Аверкова Анастасія=96, Соловйов Даніїл=85, Крамар Віктор=80}, ІО-81={Рахуба Вероніка=80, Дудка Максим=70, Іванов Володимир=54, Кобук Назар=80}, ІВ-82={Лихацька Юлія=87, Скрипченко Володимир=82, Іванов Дмитро=83}, ІП-83={Мінченко Володимир=80, Жуков Михайло=84}, ІВ-81={Базова Лідія=87, Снігурець Олег=80, Кулініч Віталій=97, Грабко Михайло=68, Дрозд Світлана=88}}
//    Завдання 4
//    {ІП-84=8.625, ІВ-83=9.4375, ІО-82=8.107142, ІО-83=10.875, ІО-81=8.875, ІВ-82=10.5, ІП-83=10.25, ІВ-81=10.5}
//    Завдання 5
//    {ІП-84=[Дмитренко Олександр], ІВ-83=[Матвійчук Андрій, Ткаченко Ярослав, Кочерук Давид, Бондаренко Максим, Дровнін Павло], ІО-82=[Лесик Сергій, Роман Олександр, Востриков Нікіта, Тарасенко Юлія, Фещенко Кирил], ІО-83=[Аверкова Анастасія, Соловйов Даніїл, Крамар Віктор], ІО-81=[Рахуба Вероніка, Дудка Максим, Кобук Назар], ІВ-82=[Лихацька Юлія, Скрипченко Володимир, Іванов Дмитро], ІП-83=[Мінченко Володимир, Жуков Михайло], ІВ-81=[Базова Лідія, Снігурець Олег, Кулініч Віталій, Грабко Михайло, Дрозд Світлана]}
}

fun randomValue(maxValue: Int): Int {
    val random = Random()

    return when (random.nextInt(6)) {
        1 -> ceil(maxValue * 0.7).toInt()
        2 -> ceil(maxValue * 0.9).toInt()
        3, 4, 5 -> maxValue
        else -> 0
    }
}
